app/controllers/api/v1/elite_items_controller.rb

  def index
    elite_items = EliteItem.all
---
SELECT "elite_items".* FROM "elite_items"

  def show
    elite_item = EliteItem.where(params[:id]).first
---
SELECT  "elite_items".* FROM "elite_items" WHERE "elite_items"."id" = ? LIMIT 1  [["id", nil]]