app/controllers/api/v1/traits_controller.rb

SELECT "traits".* FROM "traits"
---
  def index
    traits = Trait.all